// Пусть дан массив ['1', '2', '3', '4', '5', '6']. Сделайте из него строку '16-25-34'.

// const arr = ['1', '2', '3', '4', '5', '6']
// let res = []
// while (arr.length > 0){
//     const str1 = arr.shift()
//     const str2 = arr.pop()
//     const sum = str1 + str2
//     res.push(sum)
// }
// result = res.join('-')
// console.log(result)

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Дан массив arr. Найдите среднее арифметическое его элементов. Проверьте задачу на массиве с элементами 12, 15, 20, 25, 59, 79

// const arr = [12, 15, 20, 25, 59, 79]
// let sum = 0
// for (i = 0; i < arr.length; i++){
//     sum += arr[i]
// }
// const aver = sum / arr.length
// console.log(aver)

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Дан массив с элементами 4, 2, 5, 19, 13, 0, 10. Найдите квадратный корень из суммы кубов его элементов. Для решения воспользуйтесь циклом for

// const arr = [4, 2, 5, 19, 13, 0, 10]
// let sum = 0
// for (i = 0; i < arr.length; i++){
//     sum += Math.pow(arr[i], 3)
// }
// console.log(Math.sqrt(sum))

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Дана строка из 6-ти цифр. Проверьте, что сумма первых трех цифр равняется сумме вторых трех цифр.
// Если это так - выведите 'да', в противном случае выведите 'нет'.

// const str = '123456'
// const sum1 = Number(str[0]) + Number(str[1]) + Number(str[2])
// const sum2 = Number(str[3]) + Number(str[4]) + Number(str[5])
// if (sum1 === sum2){
//     console.log('Да')
// }
// else{
//     console.log('Нет')
// }