// Пусть дан массив ['1', '2', '3', '4', '5', '6']. Сделайте из него строку '16-25-34'.

// const arr = ['1', '2', '3', '4', '5', '6']
// let res = []
// while (arr.length > 0){
//     const str1 = arr.shift()
//     const str2 = arr.pop()
//     const sum = str1 + str2
//     res.push(sum)
// }
// result = res.join('-')
// console.log(result)

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Дан массив arr. Найдите среднее арифметическое его элементов. Проверьте задачу на массиве с элементами 12, 15, 20, 25, 59, 79

// const arr = [12, 15, 20, 25, 59, 79]
// let sum = 0
// for (i = 0; i < arr.length; i++){
//     sum += arr[i]
// }
// const aver = sum / arr.length
// console.log(aver)

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Дан массив с элементами 4, 2, 5, 19, 13, 0, 10. Найдите квадратный корень из суммы кубов его элементов. Для решения воспользуйтесь циклом for

// const arr = [4, 2, 5, 19, 13, 0, 10]
// let sum = 0
// for (i = 0; i < arr.length; i++){
//     sum += Math.pow(arr[i], 3)
// }
// console.log(Math.sqrt(sum))

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Дана строка из 6-ти цифр. Проверьте, что сумма первых трех цифр равняется сумме вторых трех цифр.
// Если это так - выведите 'да', в противном случае выведите 'нет'.

// const str = '123456'
// const sum1 = Number(str[0]) + Number(str[1]) + Number(str[2])
// const sum2 = Number(str[3]) + Number(str[4]) + Number(str[5])
// if (sum1 === sum2){
//     console.log('Да')
// }
// else{
//     console.log('Нет')
// }

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Дано число, например 31. Проверьте, что это число не делится ни на одно другое число кроме себя самого и единицы.
// То есть в нашем случае нужно проверить, что число 31 не делится на все числа от 2 до 30.
// Если число не делится - выведите 'false', а если делится - выведите 'true'.

// const num = 31
// function divide(num) {
//     for (i = num - 1; i >= 2; i--) {
//         if (num % i == 0) {
//             return true
//         }
//     }
//     return false
// }
// console.log(divide(num))

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Дан массив с числами. Найдите позицию первого числа 3 в этом массиве (считаем, что это число обязательно есть в массиве).

// const arr = [22, 33, 15, 6, -4, 0, 42, 3, 5, 66]
// let arr2 = []
// for (let num of arr){
//     if (num == 3){
//         break;
//     }
//     arr2.push(num)
// }
// console.log(arr2.length)

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Переберите циклом числа от 10 до 1000 и выведите на экран те числа, сумма двух первых цифр которых равна 5.

// for (i = 10; i <= 1000; i++){
//     let str = String(i)
//     if (Number(str[0]) + Number(str[1]) === 5){
//         console.log(str)
//     }
// }

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Дан следующий объект:
//     let obj = {1: 6, 2: 7, 3: 8, 4: 9, 5: 10};
// Найдите сумму ключей этого объекта и поделите ее на сумму значений.

// let obj = {1: 6, 2: 7, 3: 8, 4: 9, 5: 10};
// let sumKey = 0
// let sumValues = 0
// for (let num in obj){
//     sumKey += Number(num)
// }
// for (let val in obj){
//     sumValues += obj[val]
// }
// let result = sumKey / sumValues
// console.log(result)

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Дан следующий объект:
//
// let obj = {
// 	1: 125,
// 	2: 225,
// 	3: 128,
// 	4: 356,
// 	5: 145,
// 	6: 281,
// 	7: 452,
// };
// Запишите в новый массив элементы, значение которых начинается с цифры 1 или цифры 2.

// let obj = {
//     1: 125,
//     2: 225,
//     3: 128,
//     4: 356,
//     5: 145,
//     6: 281,
//     7: 452,
// };
// let arr = []
// for (let num in obj){
//     if (obj[num].toString()[0] === '1' || obj[num].toString()[0] === '2'){
//         arr.push(obj[num])
//     }
// }
// console.log(arr)

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Дана вот такая структура для хранения списка дел за года, месяцы и дни:

// let affairs = {
// 	2018: {
// 		11: {
// 			29: ['дело111', 'дело112', 'дело113'],
// 			30: ['дело121', 'дело122', 'дело123'],
// 		},
// 		12: {
// 			30: ['дело211', 'дело212', 'дело213'],
// 			31: ['дело221', 'дело222', 'дело223'],
// 		},
// 	},
// 	2019: {
// 		12: {
// 			29: ['дело311', 'дело312', 'дело313'],
// 			30: ['дело321', 'дело322', 'дело323'],
// 			31: ['дело331', 'дело332', 'дело333'],
// 		}
// 	},
// }
//
// Сделайте функцию addAffair, которая будет добавлять новое дело в заданную дату.
// Пусть функция первым параметром принимает год, вторым - месяц, третьим - день, а четвертым - дело.
//
// function addAffair(year, month, day, affair){
//     if (affairs[year] === undefined){
//         affairs[year] = []
//     }
//     if (affairs[year][month] === undefined){
//         affairs[year][month] = []
//     }
//     if (affairs[year][month][day] === undefined){
//         affairs[year][month][day] = []
//     }
//     affairs[year][month][day].push(affair)
// }
// addAffair(2019, 02, 25, 'дело411')
// console.log(affairs)